---
kind: method
id: M:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.Dispose
source: html/9605f1ce-2aad-d062-e66f-fcf6fc3b80dc.htm
---
# Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.Dispose Method

Releases all resources used by the BuildingEnvelopeAnalyzer

## Syntax (C#)
```csharp
public void Dispose()
```